{
    "create.CreateActivity": "The activity involves creating, editing, sorting, filtering, sharing, and deleting albums, as well as creating collages, videos, animations, and cinematic photos.",
    "envelope.AlbumActivity": "add pictures to memory,edit memory.",
    "feed.activity.SharePublishFeedActivity": "Summary: This activity involves navigating, linking, sharing photos, creating albums, setting profile pictures, viewing news, sharing via WhatsApp, posting to stories, accessing nearby content, using Momo features, managing groups, and accessing more options.",
    "home.HomeActivity": "This activity allows users to navigate to library/memories/search, view archive/locked floder, cast content, back up photos, favorite items, and access various deleting and sharing options.",
    "nearby.sharing.send.SendActivityAlias": "The activity allows users to adjust account and privacy settings, control sharing preferences, navigate back, and initiate Nearby BETA setup.",
    "photoeditor.fragments.activity.PhotoEditorActivity": "An image editing tool with functions to use magic erase, apply blur, remove parts, edit sky, switch tabs, cancel, save, adjust, add text, rotate, resize, adjust brightness, apply filters.",
    "photoeditor.fragments.activity.VideoPhotoEditorActivity": "The activity involves editing vedioss, playing videos, trimming and muting videos, stabilizing videos, exporting frames, changing tabs, cancelling operations, and saving edited copies.",
    "share.SharouselActivity": "Share photos or vedios with other.",
    "com.android.internal.app.ChooserActivity": "Perform various actions: search, access menu, share content, view profiles, navigate, interact with posts, refresh, upload files, edit profile, adjust settings.",
    "com.android.providers.media.PermissionActivity": "The activity involves searching for contacts, opening the menu, allowing or denying actions, and allowing Photos to delete up to 5 items.",
    "com.google.android.apps.lens.MainActivity": "The activity allows users to use voice search, translate text, close screens, access more options, and switch between search and homework modes.",
    "collectionstab.collectionsgridpage.CollectionsGridPageActivity": "View all albums in a certain order, such as last modified, album title or most recent photo.",
    "backup.overview.impl.BackupOverviewActivity": "Turn on or turn off back up."
}