{
    "com.instagram.mainactivity.InstagramMainActivity": [
        {
            "name": "View Profile",
            "description": "View the user's profile page including their posts, followers, and following details."
        },
        {
            "name": "Edit Profile",
            "description": "Open the edit profile screen to update profile information, including bio and name."
        },
        {
            "name": "Follow/Unfollow User",
            "description": "Follow or unfollow the user by interacting with the 'Follow' button."
        },
        {
            "name": "View Posts",
            "description": "View the user's posts, organized in grid or reel formats."
        },
        {
            "name": "View Story Highlights",
            "description": "View the user's story highlights through the highlights carousel."
        },
        {
            "name": "Send Message",
            "description": "Send a direct message to the user by clicking on the message icon."
        },
        {
            "name": "View Followers/Following",
            "description": "View the list of the user's followers or the people they are following."
        },
        {
            "name": "Like, Comment, Save, Share Post",
            "description": "Engage with posts by liking, commenting, saving to collections, or sharing."
        },
        {
            "name": "Scroll Feed",
            "description": "Scroll through the user's post feed to view their latest content."
        },
        {
            "name": "Change Avatar",
            "description": "Change the user's profile avatar by uploading a new picture."
        },
        {
            "name": "View Notifications",
            "description": "View notifications for activities like new followers, comments, or likes."
        },
        {
            "name": "View Settings",
            "description": "Access the app's settings menu to adjust preferences and privacy settings."
        },
        {
            "name": "Switch Accounts",
            "description": "Switch between different Instagram accounts using the account switcher button."
        },
        {
            "name": "Refresh Feed",
            "description": "Refresh the profile feed to load new content."
        },
        {
            "name": "Explore Content",
            "description": "Explore recommended or trending content based on user interests."
        },
        {
            "name": "View Suggested Account",
            "description": "View and follow suggested users based on mutual connections or common interests."
        },
        {
            "name": "Dismiss Suggested User",
            "description": "Dismiss a suggested user from the suggestions carousel."
        },
        {
            "name": "Settings and Activity",
            "description": "Access settings and view activity related details on Instagram."
        },
        {
            "name": "Orders and Payments",
            "description": "Open the section to review and manage your orders and payments within Instagram."
        },
        {
            "name": "Help",
            "description": "Open the Help Center to find assistance or information on using Instagram."
        },
        {
            "name": "Privacy Center",
            "description": "Access the Privacy Center to manage your privacy settings and review options for protecting your data."
        },
        {
            "name": "Account Status",
            "description": "Check your account status and any related issues within settings."
        },
        {
            "name": "About",
            "description": "View information about Instagram, including policies, terms, and other relevant details."
        },
        {
            "name": "Add Account",
            "description": "Tap to add a new Instagram account to the app."
        },
        {
            "name": "Log Out",
            "description": "Log out from the current Instagram account."
        },
        {
            "name": "Log Out All Accounts",
            "description": "Log out from all Instagram accounts currently logged in on the app."
        },
        {
            "name": "Create",
            "description": "Start creating a new post, story, reel, or other content types on Instagram."
        },
        {
            "name": "Reels",
            "description": "Access the Reels section to view short video content shared by users on Instagram."
        },
        {
            "name": "Record Video",
            "description": "Press the button to start capturing a video."
        },
        {
            "name": "Stop Video Recording",
            "description": "Stop the video recording by pressing the stop button."
        },
        {
            "name": "Navigate to Edit Screen",
            "description": "Click the 'Edit' button (id: 16) to go to video editing options."
        },
        {
            "name": "Add Audio",
            "description": "Tap the 'Add Audio' button (id: 22) to add background music or sounds to your video."
        },
        {
            "name": "Add Text",
            "description": "Tap the 'Add Text' button (id: 23) to overlay text onto the video."
        },
        {
            "name": "Add Sticker",
            "description": "Tap the 'Add Sticker' button (id: 24) to insert a sticker or graphic into the video."
        },
        {
            "name": "Apply Effects",
            "description": "Tap the 'Effects' button (id: 25) to apply visual effects to the video."
        },
        {
            "name": "Add Voiceover",
            "description": "Tap the 'Voiceover' button (id: 26) to record and add a voiceover to the video."
        },
        {
            "name": "Add Additional Clips",
            "description": "Tap the 'Add Clips' button (id: 27) to insert additional video clips."
        },
        {
            "name": "Enable Captions",
            "description": "Tap the 'Captions' button (id: 28) to add automated captions or subtitles to the video."
        },
        {
            "name": "Save Video",
            "description": "Tap the 'Save' button (id: 29) to save your edited video to your gallery."
        },
        {
            "name": "Cancel Edits",
            "description": "Press the 'Cancel' button (id: 31) to discard any changes and return to the previous screen."
        },
        {
            "name": "Navigate to Video Preview",
            "description": "Watch the recorded video preview in the post-capture preview area."
        },
        {
            "name": "Apply Template",
            "description": "Use the template browser (id: 45) to apply predefined templates to the video."
        },
        {
            "name": "Preview Video",
            "description": "Tap the preview button in the post-capture preview container (id: 39) to view your video before sharing."
        },
        {
            "name": "Open Camera Settings",
            "description": "Open the camera tool menu (id: 52) to adjust settings like flash or resolution."
        },
        {
            "name": "Capture Still Image",
            "description": "Press the 'Capture' button (within id: 5) to take a snapshot during the video recording."
        },
        {
            "name": "Toggle Camera Modes",
            "description": "Use the mode toggle button in the pre-capture control container (id: 43) to switch between camera modes."
        },
        {
            "name": "Enable AR Effects",
            "description": "Tap the AR effects button (id: 25) to open augmented reality effects and filters."
        },
        {
            "name": "Adjust Clip Length",
            "description": "Trim or adjust the video length by interacting with the preview container (id: 39)."
        },
        {
            "name": "Quick Capture",
            "description": "Initiate a quick capture session from the quick capture fragment/container."
        },
        {
            "name": "Shutter Button",
            "description": "Capture a photo or video using the shutter button."
        },
        {
            "name": "Toggle Flash",
            "description": "Turn the flash on or off using the flash button."
        },
        {
            "name": "Switch Camera",
            "description": "Switch between the front and back camera using the switch camera button."
        },
        {
            "name": "Access Gallery",
            "description": "Open the gallery to view previously taken or existing images and videos."
        },
        {
            "name": "Story Settings",
            "description": "Open story settings using the settings gear icon."
        },
        {
            "name": "Expand Tools Menu",
            "description": "Expand the tools menu to access additional camera functionalities."
        },
        {
            "name": "Interactive Content Pre-Capture",
            "description": "Engage with interactive content options before capturing media."
        },
        {
            "name": "Navigate Using Swipe",
            "description": "Navigate through the app interface using swipe actions within the navigation container."
        },
        {
            "name": "Access Camera Tool Menu",
            "description": "Access various camera tools using the tool menu container."
        },
        {
            "name": "Select a Media",
            "description": "Select a specific post, reel, or photo displayed in the profile media section like a reel by 'huhuli' or a photo."
        },
        {
            "name": "Leave a New Note",
            "description": "Leave a new note for followers you follow back, sharing a message or update."
        },
        {
            "name": "Delete Note",
            "description": "Delete an existing note shared with the followers."
        },
        {
            "name": "Template Browser",
            "description": "Browse through available templates for creating content on Instagram."
        },
        {
            "name": "Gallery Access",
            "description": "Open the gallery to view, select or upload photos or videos from the device to Instagram."
        },
        {
            "name": "Switch Album",
            "description": "Use the album switcher to change between different albums in the gallery, such as Recents."
        },
        {
            "name": "Fast Scroll Gallery",
            "description": "Use the fast scroll feature to quickly navigate through the gallery images."
        },
        {
            "name": "Share",
            "description": "Share your media via various means by pressing the 'Share to' button, opening up sharing options beyond stories."
        },
        {
            "name": "Create Mode",
            "description": "Enter Create Mode, which offers a more creative layout and tools for generating unique content."
        },
        {
            "name": "Boomerang",
            "description": "Access Boomerang, a feature that creates a looping video effect, by selecting the Boomerang button."
        },
        {
            "name": "Layout",
            "description": "Select the Layout button to create collages or multi-photo layouts for your media posts."
        },
        {
            "name": "Post Capture Controls",
            "description": "Use post-capture controls to edit and manage your captured photos or videos before sharing."
        },
        {
            "name": "Play/Pause Reel",
            "description": "Double tap to play or pause the reel currently being viewed."
        },
        {
            "name": "Like and View Likes",
            "description": "Like posts, reels, or stories, and view the list of users who liked the content."
        },
        {
            "name": "Comment on Content",
            "description": "Add a comment to posts, reels, or stories, or view existing comments."
        },
        {
            "name": "Share Content",
            "description": "Share posts, reels, or stories with others using various sharing options."
        },
        {
            "name": "Save Content",
            "description": "Save posts, reels, or stories to your account for later access."
        },
        {
            "name": "Emoji Reaction and View Reactions",
            "description": "React to content or comments using emojis and view who reacted."
        },
        {
            "name": "Zoom Media",
            "description": "Pinch to zoom in or out of an image or video in the feed."
        },
        {
            "name": "See More Options",
            "description": "Access additional options like reporting, copying links, and more for posts, reels, or stories."
        },
        {
            "name": "Remix Reel",
            "description": "Create a new reel using elements from the currently viewed reel."
        },
        {
            "name": "Create and Edit Content",
            "description": "Organize multiple video clips into sequences, or create new posts, stories, or reels."
        },
        {
            "name": "Check Post Insights",
            "description": "View engagement metrics like reach, impressions, and interactions for posts or reels."
        },
        {
            "name": "Manage Comments and Tagging",
            "description": "Set rules for comments, tagging, and mentions on your content."
        },
        {
            "name": "Control Sharing and Reuse",
            "description": "Manage how others can share or reuse your content."
        },
        {
            "name": "View and Manage User Profiles",
            "description": "Tap on a user’s profile image or name to visit their profile, follow, or unfollow them."
        },
        {
            "name": "Block or Unblock Users",
            "description": "Block users to restrict interaction or unblock them to allow interaction again."
        },
        {
            "name": "Manage Restrictions and Hidden Content",
            "description": "Restrict accounts or manage settings to hide your story and live videos from specific users."
        },
        {
            "name": "Account Privacy Settings",
            "description": "Adjust privacy settings for your account, including visibility and interaction controls."
        },
        {
            "name": "Manage Notifications and Limits",
            "description": "Adjust notification settings, limit interactions, mute notifications, and manage time usage."
        },
        {
            "name": "Saved and Archived Content",
            "description": "Access saved posts and archived stories or media from your account."
        },
        {
            "name": "Change Privacy Settings",
            "description": "Adjust privacy settings for posts, stories, and interactions."
        },
        {
            "name": "View Activity Log",
            "description": "Review recent activities, including posts, likes, comments, and interactions."
        },
        {
            "name": "Like",
            "description": "Tap the heart icon to like a post or reel."
        },
        {
            "name": "Comment",
            "description": "Open and post comments on a post or reel."
        },
        {
            "name": "Save Post",
            "description": "Tap the save icon to add posts or reels to your saved collection."
        },
        {
            "name": "Reshare Content",
            "description": "Share posts or reels with others using the reshare button."
        },
        {
            "name": "View Post Details",
            "description": "Open a post to view likes, comments, and sharing options."
        },
        {
            "name": "Story Interaction",
            "description": "View or interact with stories by tapping on avatars."
        },
        {
            "name": "Story Seen State",
            "description": "Check if a story has already been viewed."
        },
        {
            "name": "Create Reel",
            "description": "Start creating a reel with tools for audio, video trimming, and effects."
        },
        {
            "name": "Play/Pause Reel",
            "description": "Double tap to play or pause reels."
        },
        {
            "name": "Play Audio",
            "description": "Play or manage audio associated with reels."
        },
        {
            "name": "Zoom Media",
            "description": "Pinch or spread fingers to zoom in or out on images and videos."
        },
        {
            "name": "Swipe Navigation",
            "description": "Swipe left or right to navigate posts, stories, or carousels."
        },
        {
            "name": "Search and Explore",
            "description": "Search for content, accounts, or tags using the search tab."
        },
        {
            "name": "Home Feed",
            "description": "Navigate to the home screen to view posts and reels."
        },
        {
            "name": "Open Camera",
            "description": "Access the camera to capture or post new content."
        },
        {
            "name": "Camera Controls",
            "description": "Use camera tools like flash, filters, or switching between front and back cameras."
        },
        {
            "name": "Post Options",
            "description": "Access post actions, such as sharing, saving, reporting, or tagging users."
        },
        {
            "name": "View Carousel",
            "description": "Swipe through multiple media items in carousel posts."
        },
        {
            "name": "Overlay Interactions",
            "description": "Display and interact with stickers, pop-ups, or interactive overlays."
        },
        {
            "name": "Cancel Operation",
            "description": "Cancel the current action and return to the previous screen."
        },
        {
            "name": "View Comments",
            "description": "Expand and view all comments on a post."
        },
        {
            "name": "Open Menu",
            "description": "Access app-wide navigation using the menu icon."
        },
        {
            "name": "View Saved Content",
            "description": "Navigate to your collection of saved posts and reels."
        },
        {
            "name": "Interact with Photos",
            "description": "Select and preview images shared in grid or feed format."
        },
        {
            "name": "New Post",
            "description": "Start creating a new post by selecting or capturing media."
        },
        {
            "name": "Photo",
            "description": "Capture or select a photo from the gallery to post."
        },
        {
            "name": "Story",
            "description": "Share selected media as a story visible for 24 hours."
        },
        {
            "name": "Reel",
            "description": "Create or explore short video content, including length and speed adjustments."
        },
        {
            "name": "Live",
            "description": "Broadcast live video to followers in real time or schedule a live stream."
        },
        {
            "name": "Gallery Navigation",
            "description": "Access and navigate photos and videos available in the device gallery."
        },
        {
            "name": "Camera Controls",
            "description": "Pre-capture controls, including flash toggle, camera switch, timer, and hands-free recording."
        },
        {
            "name": "AR Effects & Filters",
            "description": "Add AR effects, filters, or creative tools to enhance captured media."
        },
        {
            "name": "Post Options",
            "description": "Choose where to share captured media: Post, Story, Reel, or Live."
        },
        {
            "name": "Edit Tools",
            "description": "Access tools to edit media, including layout, alignment, scaling, effects, and clip trimming."
        },
        {
            "name": "Gallery Preview",
            "description": "Quickly preview and select recently captured or saved media."
        },
        {
            "name": "Navigate Tabs",
            "description": "Switch between main sections like Feed, Search, Reels, Creation, or Profile."
        },
        {
            "name": "Search Bar",
            "description": "Search for content, accounts, or hashtags."
        },
        {
            "name": "Add Details",
            "description": "Add titles, descriptions, or interactive elements like polls, trivia, and 'This or That'."
        },
        {
            "name": "Drafts",
            "description": "Save and manage draft content for future posts or edits."
        },
        {
            "name": "Audience Selection",
            "description": "Modify or choose the target audience for your posts or live streams."
        },
        {
            "name": "Shopping",
            "description": "Enable or explore shopping features for posts and stories."
        },
        {
            "name": "Action Bar",
            "description": "The navigation bar containing buttons and the title of the current screen."
        },
        {
            "name": "Content Area",
            "description": "The main area where media content, posts, or stories are displayed."
        },
        {
            "name": "Green Screen",
            "description": "Apply green screen effects to videos or photos."
        },
        {
            "name": "Hands-Free Mode",
            "description": "Record videos without holding down the shutter button."
        }
    ],
    "com.instagram.modal.ModalActivity": [
        {
            "name": "Log In",
            "description": "Sign in to your account by clicking the 'Log in' button."
        },
        {
            "name": "Log Into Another Account",
            "description": "Sign in using a different Instagram account by clicking the 'Log into another account' button."
        },
        {
            "name": "Create New Account",
            "description": "Register a new Instagram account by clicking the 'Create new account' button."
        },
        {
            "name": "Edit Cover",
            "description": "Click on the 'Edit cover' option to make adjustments to the new reel cover photo."
        },
        {
            "name": "Write Caption",
            "description": "Click on the caption input area to write a caption and add hashtags."
        },
        {
            "name": "Add Hashtags",
            "description": "Use the hashtags suggestion option to add relevant hashtags to your post."
        },
        {
            "name": "Create Poll",
            "description": "Use the poll suggestion option to create and add a poll to your post."
        },
        {
            "name": "Tag People",
            "description": "Select the 'Tag people' option to tag users in your post."
        },
        {
            "name": "Add Location",
            "description": "Click on the 'Add location' option to include a location with the post."
        },
        {
            "name": "Choose Audience",
            "description": "Select 'Audience' to decide who can see the post, e.g., everyone."
        },
        {
            "name": "Set Profile Display",
            "description": "Choose profile display settings to determine where this post will appear, such as the Main grid and Reels grid."
        },
        {
            "name": "Rename Audio",
            "description": "Select 'Rename audio' to change the name of the audio associated with the post."
        },
        {
            "name": "Save Draft",
            "description": "Click on the 'Save draft' button to save your current progress on the post as a draft for later editing or sharing."
        },
        {
            "name": "Share Post",
            "description": "Press the 'Share' button to publish the post to your profile immediately."
        },
        {
            "name": "Edit Highlight Cover",
            "description": "Tap the 'Edit cover' link to change the cover image for a highlight."
        },
        {
            "name": "Edit Highlight Title",
            "description": "Tap the 'highlight_title' button to modify the title of a highlight."
        },
        {
            "name": "Select Media",
            "description": "Tap on media images to select or deselect them using the 'selected_item_overlay' and 'media_toggle' buttons."
        }
    ],
    "com.instagram.modal.TransparentModalActivity": [
        {
            "name": "Browse stories",
            "description": "Navigate through different pictures of your story using the browse button."
        },
        {
            "name": "Create Story Highlight",
            "description": "Access the option to create a story highlight from a reel."
        },
        {
            "name": "Send Story",
            "description": "Send the current story to another user through a reshare button."
        },
        {
            "name": "More Options",
            "description": "Open additional settings and options related to the reel viewer with the more options button."
        },
        {
            "name": "Remove from highlight",
            "description": "Remove the picture from highlight. "
        },
        {
            "name": "Edit highlight",
            "description": "Edit the highlight picture."
        },
        {
            "name": "Share the picture of Story",
            "description": "Send the current story to another user through a reshare button."
        },
        {
            "name": "Copy link",
            "description": "Copy the link of the story."
        },
        {
            "name": "Show QR code",
            "description": "Show the QR code of the story."
        }
    ],
    "ui0": [
        {
            "name": "Log Out Prompt",
            "description": "The user is presented with a prompt asking if they are sure they want to log out of their account."
        },
        {
            "name": "Log Out Confirmation",
            "description": "The user can confirm their decision to log out by clicking the 'Log out' button."
        },
        {
            "name": "Cancel Log Out",
            "description": "The user can cancel the log-out operation by clicking the 'Cancel' button."
        },
        {
            "name": "Open Dialog",
            "description": "The dialog containing the log-out confirmation and cancel options is displayed on the screen."
        },
        {
            "name": "Scroll Through Content",
            "description": "The user can scroll through the content in the scrollable area (identified by the 'scroll_view' div)."
        },
        {
            "name": "Interact with Sticky Footer",
            "description": "The user can interact with elements in the sticky footer at the bottom of the screen, which might contain navigation options or other actionable buttons."
        },
        {
            "name": "Close Dialog",
            "description": "The user can close the dialog without taking any action, usually by pressing the 'Cancel' button or tapping outside the dialog."
        },
        {
            "name": "Confirm Action",
            "description": "The user can click the primary action button (Log out) to confirm their action."
        }
    ]
}