{
    "state1": [
        {
            "name": "View Profile",
            "description": "View the user's profile page including their posts, followers, and following details."
        },
        {
            "name": "Edit Profile",
            "description": "Open the edit profile screen to update profile information, including bio, name, and other details."
        },
        {
            "name": "Share Profile",
            "description": "Share the user's profile with others through available sharing options."
        },
        {
            "name": "Follow User",
            "description": "Follow or unfollow the user displayed on the profile by interacting with the 'Follow' button."
        },
        {
            "name": "View Posts",
            "description": "View the user's posts, organized in grid view or other display formats like reels or highlights."
        },
        {
            "name": "View Story Highlights",
            "description": "View the user's story highlights by interacting with the highlights carousel."
        },
        {
            "name": "View Recent Story",
            "description": "View the user's recent story by clicking on their avatar or story thumbnail."
        },
        {
            "name": "Create Highlight",
            "description": "Create a new highlight from the user's existing stories by clicking the 'Create Highlight' button."
        },
        {
            "name": "Send Message",
            "description": "Send a direct message to the user by clicking on the message icon or button in their profile."
        },
        {
            "name": "View Followers",
            "description": "Click on the 'Followers' button to see the list of people following the user."
        },
        {
            "name": "View Following",
            "description": "Click on the 'Following' button to see the list of people the user is following."
        },
        {
            "name": "View Profile Picture",
            "description": "Click on the user's profile picture to view it in full size or edit the avatar image."
        },
        {
            "name": "Dismiss Suggested User",
            "description": "Dismiss a suggested user from the suggestions carousel by clicking the 'Dismiss' button."
        },
        {
            "name": "View Suggested Account",
            "description": "View and follow suggested users based on mutual connections or common interests."
        },
        {
            "name": "Scroll Feed",
            "description": "Scroll through the user's post feed to view their latest content."
        },
        {
            "name": "Change Avatar",
            "description": "Change the user's profile avatar by clicking on the avatar image or button to upload a new picture."
        },
        {
            "name": "View Notifications",
            "description": "View notifications for activities like new followers, comments, or likes by interacting with the notification icon in the action bar."
        },
        {
            "name": "Switch Accounts",
            "description": "Switch between different Instagram accounts by clicking the account switcher button in the action bar."
        },
        {
            "name": "Refresh Feed",
            "description": "Refresh the profile feed by pulling down or using the swipe-refresh feature to load new content."
        }
    ],
    "state10": [
        {
            "name": "Back",
            "description": "Navigate to the previous screen or exit the current view by tapping the 'Back' button."
        },
        {
            "name": "Settings and Activity",
            "description": "Access settings and view activity related details on Instagram."
        },
        {
            "name": "Orders and Payments",
            "description": "Open the section to review and manage your orders and payments within Instagram."
        },
        {
            "name": "Help",
            "description": "Open the Help Center to find assistance or information on using Instagram."
        },
        {
            "name": "Privacy Center",
            "description": "Access the Privacy Center to manage your privacy settings and review options for protecting your data."
        },
        {
            "name": "Account Status",
            "description": "Check your account status and any related issues within settings."
        },
        {
            "name": "About",
            "description": "View information about Instagram, including policies, terms, and other relevant details."
        },
        {
            "name": "Add Account",
            "description": "Tap to add a new Instagram account to the app."
        },
        {
            "name": "Log Out",
            "description": "Log out from the current Instagram account."
        },
        {
            "name": "Log Out All Accounts",
            "description": "Log out from all Instagram accounts currently logged in on the app."
        },
        {
            "name": "Home",
            "description": "Navigate to the main feed where you can see posts from followed accounts and new content."
        },
        {
            "name": "Search and Explore",
            "description": "Open the search interface to find users, hashtags, and explore recommended content."
        },
        {
            "name": "Create",
            "description": "Start creating a new post, story, reel, or other content types on Instagram."
        },
        {
            "name": "Reels",
            "description": "Access the Reels section to view short video content shared by users on Instagram."
        },
        {
            "name": "Profile",
            "description": "Go to your Instagram profile to view and edit your posts, bio, and account settings."
        }
    ],
    "state13": [
        {
            "name": "Record Video",
            "description": "Press the button to start capturing a video."
        },
        {
            "name": "Stop Video Recording",
            "description": "Stop the video recording by pressing the stop button."
        },
        {
            "name": "Navigate to Edit Screen",
            "description": "Click the 'Edit' button (id: 16) to go to video editing options."
        },
        {
            "name": "Add Audio",
            "description": "Tap the 'Add Audio' button (id: 22) to add background music or sounds to your video."
        },
        {
            "name": "Add Text",
            "description": "Tap the 'Add Text' button (id: 23) to overlay text onto the video."
        },
        {
            "name": "Add Sticker",
            "description": "Tap the 'Add Sticker' button (id: 24) to insert a sticker or graphic into the video."
        },
        {
            "name": "Apply Effects",
            "description": "Tap the 'Effects' button (id: 25) to apply visual effects to the video."
        },
        {
            "name": "Add Voiceover",
            "description": "Tap the 'Voiceover' button (id: 26) to record and add a voiceover to the video."
        },
        {
            "name": "Add Additional Clips",
            "description": "Tap the 'Add Clips' button (id: 27) to insert additional video clips."
        },
        {
            "name": "Enable Captions",
            "description": "Tap the 'Captions' button (id: 28) to add automated captions or subtitles to the video."
        },
        {
            "name": "Save Video",
            "description": "Tap the 'Save' button (id: 29) to save your edited video to your gallery."
        },
        {
            "name": "Cancel Edits",
            "description": "Press the 'Cancel' button (id: 31) to discard any changes and return to the previous screen."
        },
        {
            "name": "Share Video",
            "description": "Tap the 'Share' button (id: 33) to post the edited video to the platform or share it with others."
        },
        {
            "name": "Navigate to Video Preview",
            "description": "Watch the recorded video preview in the post-capture preview area."
        },
        {
            "name": "Apply Template",
            "description": "Use the template browser (id: 45) to apply predefined templates to the video."
        },
        {
            "name": "Adjust Focus",
            "description": "Tap on the 'Focus View' (id: 58) to focus on a specific part of the scene during recording."
        },
        {
            "name": "Adjust Volume",
            "description": "Adjust the audio volume by pressing the volume control button (id: 22) during video editing."
        },
        {
            "name": "Preview Video",
            "description": "Tap the preview button in the post-capture preview container (id: 39) to view your video before sharing."
        },
        {
            "name": "Open Camera Settings",
            "description": "Open the camera tool menu (id: 52) to adjust settings like flash or resolution."
        },
        {
            "name": "Capture Still Image",
            "description": "Press the 'Capture' button (within id: 5) to take a snapshot during the video recording."
        },
        {
            "name": "Toggle Camera Modes",
            "description": "Use the mode toggle button in the pre-capture control container (id: 43) to switch between camera modes."
        },
        {
            "name": "Enable AR Effects",
            "description": "Tap the AR effects button (id: 25) to open augmented reality effects and filters."
        },
        {
            "name": "Use Quick Capture",
            "description": "Quickly begin recording by tapping the quick capture button in the top toolbar."
        },
        {
            "name": "Adjust Clip Length",
            "description": "Trim or adjust the video length by interacting with the preview container (id: 39)."
        }
    ],
    "state19": [
        {
            "name": "Shutter Button",
            "description": "Capture a photo or video using the shutter button."
        },
        {
            "name": "Toggle Flash",
            "description": "Turn the flash on or off using the flash button."
        },
        {
            "name": "Switch Camera",
            "description": "Switch between the front and back camera using the switch camera button."
        },
        {
            "name": "Access Gallery",
            "description": "Open the gallery to view previously taken or existing images and videos to add to layout."
        },
        {
            "name": "Story Settings",
            "description": "Open story settings using the settings gear icon."
        },
        {
            "name": "Apply AR Effects",
            "description": "Choose and apply augmented reality effects using the AR effect picker."
        },
        {
            "name": "Add content to layout",
            "description": "Take a photo or select picture from gallery to layout."
        }
    ],
    "state2": [
        {
            "name": "Leave a New Note",
            "description": "Leave a new note for followers you follow back, sharing a message or update."
        },
        {
            "name": "Delete Note",
            "description": "Delete an existing note shared with the followers."
        }
    ],
    "state20": [
        {
            "name": "Open Menu",
            "description": "Access the menu options available in the Instagram app, usually from the action bar."
        },
        {
            "name": "Capture Photo/Video",
            "description": "Access the quick capture options to take a picture or record a video using Instagram's camera features."
        },
        {
            "name": "Post-Capture Controls",
            "description": "Use the controls available after capturing a photo or video to edit or enhance the content before sharing."
        },
        {
            "name": "Camera Permissions",
            "description": "Manage or check camera permissions required for using Instagram's camera features."
        },
        {
            "name": "Template Browser",
            "description": "Browse through available templates for creating content on Instagram."
        },
        {
            "name": "Gallery Access",
            "description": "Open the gallery to view, select or upload photos or videos from the device to Instagram."
        },
        {
            "name": "Switch Album",
            "description": "Use the album switcher to change between different albums in the gallery, such as Recents."
        },
        {
            "name": "Fast Scroll Gallery",
            "description": "Use the fast scroll feature to quickly navigate through the gallery images."
        },
        {
            "name": "Open Camera",
            "description": "Use the option to switch from the gallery to directly opening Instagram's camera."
        },
        {
            "name": "Open Templates",
            "description": "Navigate to the Templates section for creative content on Instagram."
        },
        {
            "name": "Open Photos",
            "description": "Move from other sections of Instagram to the Photos section, possibly to view and select photos."
        },
        {
            "name": "Back to Home",
            "description": "Navigate back to the home screen or previous screen from the gallery or other sections."
        },
        {
            "name": "Camera Settings",
            "description": "Access camera settings for adjusting preferences related to Instagram’s camera."
        }
    ],
    "state21": [
        {
            "name": "Add Text",
            "description": "Add text to the media by selecting the 'Add text' button, which allows you to overlay text onto your captured images or videos."
        },
        {
            "name": "Emojis and Stickers",
            "description": "Access and overlay emojis and stickers onto your media by selecting the corresponding button."
        },
        {
            "name": "Camera Effects",
            "description": "Apply various AR effects to your camera feed or media by selecting the camera effects button."
        },
        {
            "name": "Add Music",
            "description": "Include music in your media by selecting the music button, allowing you to choose a soundtrack for your video."
        },
        {
            "name": "More Actions",
            "description": "Open additional actions or options by selecting the overflow button, providing more functionalities such as saving, sending, or editing your capture."
        },
        {
            "name": "Share to Story",
            "description": "Share your media to your Instagram story by pressing the 'Your Story' button, making it visible to all your followers for a limited time."
        },
        {
            "name": "Share to Close Friends",
            "description": "Share your media exclusively with your close friends list on Instagram by pressing the 'Close Friends' button."
        },
        {
            "name": "Share",
            "description": "Share your media via various means by pressing the 'Share to' button, opening up sharing options beyond stories."
        }
    ],
    "state22": [
        {
            "name": "Quick Capture",
            "description": "Initiate the quick capture feature to quickly take photos or videos."
        },
        {
            "name": "Search",
            "description": "Use the search bar to find contacts, posts, or other content within Instagram."
        },
        {
            "name": "Select Sticker",
            "description": "Choose various stickers such as Location, Mention, Music Overlay, Gif, etc. to add to your post."
        },
        {
            "name": "Asset Picker",
            "description": "Browse and select assets like photos and videos from your gallery to include in your post."
        },
        {
            "name": "Stickers Drawer",
            "description": "Access a redesigned drawer of stickers to enhance your stories or posts."
        },
        {
            "name": "Create Mode",
            "description": "Enable Create Mode to start designing your content with various tools and options."
        },
        {
            "name": "Boomerang",
            "description": "Create short, looping videos by using the Boomerang tool."
        },
        {
            "name": "Layout",
            "description": "Arrange multiple pictures in a single frame using the Layout option."
        },
        {
            "name": "Post Capture Controls",
            "description": "Use post-capture controls to edit and manage your captured photos or videos before sharing."
        },
        {
            "name": "Share",
            "description": "Share your final post or story on Instagram after editing and applying the desired touches."
        },
        {
            "name": "Gallery Access",
            "description": "Open and browse your gallery to select media for posting."
        },
        {
            "name": "Stickers Search",
            "description": "Search for GIFs and other stickers to add a fun element to your posts."
        }
    ],
    "state24": [
        {
            "name": "Capture Media",
            "description": "Open camera to capture photos or videos directly."
        },
        {
            "name": "Play/Pause Reel",
            "description": "Double tap to play or pause the reel currently being viewed."
        },
        {
            "name": "Follow User",
            "description": "Follow the user sharing the reel by clicking the follow button."
        },
        {
            "name": "Like Reel",
            "description": "Like the reel by tapping on the like button."
        },
        {
            "name": "View Likes",
            "description": "View the list of users who liked this reel."
        },
        {
            "name": "Comment on Reel",
            "description": "Add a comment to the reel or view existing comments."
        },
        {
            "name": "Share Reel",
            "description": "Share the reel with others using various sharing options."
        },
        {
            "name": "See More Options",
            "description": "Access additional options for the reel by tapping the 'More' button."
        },
        {
            "name": "View Creator Profile",
            "description": "Navigate to the reel creator’s profile by tapping their profile image or name."
        },
        {
            "name": "Explore Home Feed",
            "description": "Navigate to the home feed displaying posts and stories from followed users."
        },
        {
            "name": "Search and Explore",
            "description": "Discover new content and users by using the search and explore feature."
        },
        {
            "name": "Create Content",
            "description": "Access camera and creation tools for creating new posts and reels."
        },
        {
            "name": "View Reels",
            "description": "Browse and view a collection of Instagram reels from various users."
        },
        {
            "name": "Access Profile",
            "description": "Navigate to the gallery, settings, and options available in the user's own profile."
        },
        {
            "name": "Save Reel",
            "description": "Save the reel to your account for easy access later."
        },
        {
            "name": "Remix Reel",
            "description": "Create a new reel using elements from the currently viewed reel."
        },
        {
            "name": "Sequence Reel",
            "description": "Organize multiple video clips into a sequence for your reel."
        },
        {
            "name": "Control Options",
            "description": "Manage options like translations, closed captions, and feedback for content seen."
        },
        {
            "name": "Manage Content Preferences",
            "description": "Adjust settings and preferences for the visibility and relevance of content in your feed."
        },
        {
            "name": "Dismiss Notifications",
            "description": "Dismiss or manage notifications related to activity and contents."
        }
    ],
    "state25": [
        {
            "name": "Follow User",
            "description": "Follow a suggested user by clicking the 'Follow' button next to their name."
        },
        {
            "name": "View User Profile",
            "description": "Click on a user's avatar or name to navigate to their profile."
        },
        {
            "name": "View Story Highlights",
            "description": "Click on a story highlight to view it."
        },
        {
            "name": "Create Highlight",
            "description": "Click the 'Create highlight' button to create a new highlight from your stories."
        },
        {
            "name": "View Grid",
            "description": "Switch to grid view to see a user's posts in a grid layout."
        },
        {
            "name": "View Reels",
            "description": "Switch to reels view to see a user's video content."
        },
        {
            "name": "View Photos of You",
            "description": "View posts that you have been tagged in by switching to the 'Photos of You' tab."
        },
        {
            "name": "View Media in Row",
            "description": "Click on a media item (photo or video) within a row to view it in full-screen mode."
        },
        {
            "name": "Swipe to Refresh",
            "description": "Pull down to refresh the feed or profile page."
        },
        {
            "name": "Search",
            "description": "Click the 'Search and explore' tab to search for users, tags, or content."
        },
        {
            "name": "Access Menu",
            "description": "Click the menu button (three horizontal lines or similar) to access the settings or other options."
        },
        {
            "name": "View Notifications",
            "description": "Click on the notification icon to view your unread notifications."
        },
        {
            "name": "Switch to Threads",
            "description": "Click the option to view the profile on Threads, if applicable."
        },
        {
            "name": "Create New Post",
            "description": "Click the 'Create New' button to create a new post, story, or other content."
        },
        {
            "name": "Switch to Home Feed",
            "description": "Click the 'Home' tab to return to the main feed."
        },
        {
            "name": "Switch to Profile",
            "description": "Click the 'Profile' tab to go to your own profile page."
        },
        {
            "name": "View Suggested Users",
            "description": "View a list of suggested users to follow under the 'Suggested Entity' section."
        },
        {
            "name": "View Profile Header",
            "description": "Click on the profile header to view more details like username, bio, and follower/following count."
        },
        {
            "name": "Open Bottom Sheet",
            "description": "Click or swipe up to open the bottom sheet containing additional options or media."
        },
        {
            "name": "Close Modal",
            "description": "Click the close button or background overlay to close the modal or pop-up window."
        },
        {
            "name": "Access Settings",
            "description": "Click the settings or options button to modify profile settings or app preferences."
        },
        {
            "name": "Scroll through Content",
            "description": "Swipe or scroll through content like photos, reels, or suggested accounts."
        },
        {
            "name": "Interact with Avatar",
            "description": "Click or tap on a user's avatar to view their profile or start interacting with them."
        },
        {
            "name": "Tap on Action Bar",
            "description": "Tap on the action bar elements for navigation or interaction within the app."
        },
        {
            "name": "View Unread Notifications",
            "description": "Click the red dot on the action bar to access unread notifications."
        },
        {
            "name": "Switch Between Tabs",
            "description": "Click between tabs (Feed, Search, Reels, Profile) to switch between different sections of the app."
        },
        {
            "name": "Access Story",
            "description": "Click on a user's profile or story to view their story highlights or recent posts."
        },
        {
            "name": "View Suggested Content",
            "description": "Browse through suggested content under the 'Suggested Entity' cards, which includes following or viewing content."
        },
        {
            "name": "Interact with Post",
            "description": "Like, comment, or share posts displayed in the user's feed or profile."
        },
        {
            "name": "Perform Search",
            "description": "Enter a search term to find posts, users, or hashtags."
        },
        {
            "name": "Swipe to Navigate",
            "description": "Swipe through different sections or tabs (e.g., profile, feed, or story highlights)."
        },
        {
            "name": "View Media Set",
            "description": "Click on a media set row (photos or videos) to view grouped media items."
        },
        {
            "name": "Interact with Avatar Image",
            "description": "Tap on the profile picture or avatar to view or change the user's profile image."
        }
    ],
    "state3": [
        {
            "name": "View Reel",
            "description": "Open and view the reel content posted by the user wormforbook65. Double tap to play or pause the reel."
        },
        {
            "name": "Browse Reels",
            "description": "Browse reels by scrolling down or up."
        },
        {
            "name": "Follow User",
            "description": "Follow the user who created the reel, identified as wormforbook65."
        },
        {
            "name": "See More",
            "description": "Expand the reel's caption and comments section to see more details."
        },
        {
            "name": "Like Reel",
            "description": "Like the current reel by tapping the like button."
        },
        {
            "name": "Comment on Reel",
            "description": "View and add comments to the current reel. Displays the number of existing comments, which is 184."
        },
        {
            "name": "Share Reel",
            "description": "Share the current reel with others through different platforms or direct message."
        },
        {
            "name": "More Options",
            "description": "View additional options for interacting with the reel, such as reporting or saving."
        },
        {
            "name": "Create Reel",
            "description": "Access the camera or creation tools to make a new reel."
        },
        {
            "name": "Switch Tab",
            "description": "Navigate between different sections like Home, Search, Create, Reels, and Profile using the bottom tab bar."
        },
        {
            "name": "Access Home",
            "description": "Return to the home feed to view posts from followed users."
        },
        {
            "name": "Search and Explore",
            "description": "Search for content or explore trending and recommended posts."
        },
        {
            "name": "Visit Profile",
            "description": "Access your profile page to view your posts, followers, and account settings."
        },
        {
            "name": "View Profile Picture",
            "description": "View the profile picture of the user who posted the current reel."
        }
    ],
    "state4": [
        {
            "name": "Open Settings",
            "description": "Tap on the 'Settings' section to access your account settings, privacy settings, and activity preferences."
        },
        {
            "name": "Access Account",
            "description": "Tap on 'Your Account' to access or manage your profile and account settings."
        },
        {
            "name": "Manage Accounts Center",
            "description": "Tap on 'Accounts Center' to manage your account settings across Meta technologies."
        },
        {
            "name": "Password and Security Settings",
            "description": "Tap 'Password, security, personal details, ad preferences' to adjust security settings and manage preferences."
        },
        {
            "name": "View Saved Items",
            "description": "Tap on 'Saved' to view posts, photos, and other items you have saved on Instagram."
        },
        {
            "name": "View Archive",
            "description": "Tap on 'Archive' to view your archived posts and stories."
        },
        {
            "name": "View Your Activity",
            "description": "Tap on 'Your Activity' to manage and view your Instagram activity, including interactions and media."
        },
        {
            "name": "Manage Notifications",
            "description": "Tap on 'Notifications' to access and adjust your notification preferences."
        },
        {
            "name": "Time Management Settings",
            "description": "Tap on 'Time management' to view and set time limits for using Instagram."
        },
        {
            "name": "Account Privacy Settings",
            "description": "Tap on 'Account privacy' to check or change your account privacy settings (e.g., public or private)."
        }
    ],
    "state5": [
        {
            "name": "Back",
            "description": "Navigate back to the previous screen by tapping the 'Back' button located at id 9."
        },
        {
            "name": "Settings",
            "description": "Open the settings section where users can manage their Instagram settings like notifications, privacy, and account management. Identified by id 10."
        },
        {
            "name": "Notifications",
            "description": "View or modify notification settings related to Instagram. This can be accessed by double-tapping the section labeled 'Notifications' (id 12)."
        },
        {
            "name": "Time Management",
            "description": "View and manage your Instagram usage statistics and set time limits for usage. This option can be accessed by double-tapping the section labeled 'Time management' (id 14)."
        },
        {
            "name": "Account Privacy",
            "description": "Change the privacy settings of your account, such as making it public or private. Accessible by double-tapping the section labeled 'Account privacy' (id 17)."
        },
        {
            "name": "Close Friends",
            "description": "Manage your 'Close Friends' list, controlling who sees your private stories. Accessed by double-tapping the section labeled 'Close Friends' (id 19)."
        },
        {
            "name": "Crossposting",
            "description": "Manage your crossposting settings with other social media platforms. You can access this feature by double-tapping the section labeled 'Crossposting' (id 21)."
        },
        {
            "name": "Blocked Accounts",
            "description": "Manage your blocked accounts or add new ones. This can be accessed by double-tapping the section labeled 'Blocked' (id 23)."
        },
        {
            "name": "Hide Story and Live",
            "description": "Control who can see your Instagram Stories and live videos. Double-tap the section labeled 'Hide story and live' (id 25) to manage this setting."
        },
        {
            "name": "Messages and Story Replies",
            "description": "Manage who can send you messages or reply to your Instagram stories. Accessed by double-tapping the section labeled 'Messages and story replies' (id 28)."
        },
        {
            "name": "Tags and Mentions",
            "description": "Control who can tag or mention you in posts. Accessed by double-tapping the section labeled 'Tags and mentions' (id 30)."
        },
        {
            "name": "Comments Settings",
            "description": "Set rules for comments on your posts. You can access and modify these settings by double-tapping the section labeled 'Comments' (id 32)."
        },
        {
            "name": "Sharing and Reuse",
            "description": "Control how others can share or reuse your content. Access this by double-tapping the section labeled 'Sharing and reuse' (id 34)."
        }
    ],
    "state6": [
        {
            "name": "Back",
            "description": "Press the back button to return to the previous screen in the app navigation."
        },
        {
            "name": "Messages and Story Replies",
            "description": "Double tap to open message settings to control who can send you messages and reply to your stories on Instagram."
        },
        {
            "name": "Tags and Mentions",
            "description": "Double tap to open settings to manage who can tag or mention you in their Instagram content."
        },
        {
            "name": "Comments",
            "description": "Double tap to open settings for managing the comments on your posts, including who can comment."
        },
        {
            "name": "Sharing and Reuse",
            "description": "Double tap to open settings that allow you to manage how your posts and stories can be shared or reused by others."
        },
        {
            "name": "Restricted Accounts",
            "description": "Double tap to manage accounts you have restricted, limiting how they can interact with you."
        },
        {
            "name": "Limit Interactions",
            "description": "Double tap to set or manage limits on certain interactions you receive on Instagram."
        },
        {
            "name": "Hidden Words",
            "description": "Double tap to manage a list of hidden words to filter out comments containing certain words you choose."
        },
        {
            "name": "Follow and Invite Friends",
            "description": "Double tap to find and follow people or invite new users to join Instagram."
        },
        {
            "name": "Favorites",
            "description": "Double tap to manage your list of favorite accounts on Instagram."
        },
        {
            "name": "Muted Accounts",
            "description": "Double tap to view and manage the accounts you have muted."
        },
        {
            "name": "Suggested Content",
            "description": "Double tap to manage the suggested content shown to you on Instagram."
        },
        {
            "name": "Like and Share Counts",
            "description": "Manage settings related to the visibility of like and share counts on your posts."
        },
        {
            "name": "Home",
            "description": "Tap the home button to return to your feed and see the latest posts from accounts you follow."
        },
        {
            "name": "Search and Explore",
            "description": "Tap to open the search function to find accounts, hashtags, and explore new content."
        },
        {
            "name": "Create",
            "description": "Tap the create button to upload new posts, stories, or reels."
        },
        {
            "name": "Reels",
            "description": "Tap to open the reels section, where you can view short, entertaining videos shared by users."
        },
        {
            "name": "Profile",
            "description": "Tap to go to your own profile where you can view and edit your posts, followers, and profile information."
        }
    ],
    "state7": [
        {
            "name": "Back",
            "description": "A button to navigate to the previous screen or menu."
        },
        {
            "name": "Favorites",
            "description": "A section that displays how many accounts you have marked as favorites. Double-tap to manage your list of favorites."
        },
        {
            "name": "Muted Accounts",
            "description": "Displays how many accounts you have muted. Double-tap to see the list of muted accounts."
        },
        {
            "name": "Suggested Content",
            "description": "Manage the suggested content that is shown to you. Double-tap to adjust settings."
        },
        {
            "name": "Like and Share Counts",
            "description": "Shows the counts of likes and shares. Manage view settings."
        },
        {
            "name": "Device Permissions",
            "description": "Manage permissions given to the device for accessing features."
        },
        {
            "name": "Archiving and Downloading",
            "description": "Manage your settings related to archiving and downloading your uploaded media. Double-tap for more options."
        },
        {
            "name": "Accessibility",
            "description": "Open accessibility settings to adjust features. Double-tap to access."
        },
        {
            "name": "Language",
            "description": "Open language settings to change the app's language. Double-tap to access."
        },
        {
            "name": "Data Usage and Media Quality",
            "description": "Manage data usage settings and preferences for media quality during uploads and playback. Double-tap to manage settings."
        },
        {
            "name": "Website Permissions",
            "description": "Manage settings related to the in-app browser and authorized apps/websites. Double-tap for more options."
        },
        {
            "name": "Family Center",
            "description": "Open a surface to add parental supervision to an account. Double-tap to access."
        },
        {
            "name": "Home",
            "description": "Navigate to the home feed to see the latest posts from the accounts you follow."
        },
        {
            "name": "Search and Explore",
            "description": "Access the search and explore section to discover new content and users. Tap to begin searching or exploring."
        },
        {
            "name": "Create",
            "description": "Open the creation menu to create new posts, stories, or other content types. Tap to start creating."
        },
        {
            "name": "Reels",
            "description": "Navigate to the Reels section to view short, engaging video content created by other users."
        },
        {
            "name": "Profile",
            "description": "Visit your profile to view or edit your personal information, posts, and settings."
        }
    ],
    "state8": [],
    "state27": [
        {
            "name": "View Post Details",
            "description": "View detailed information about a post, including likes, comments, and description."
        },
        {
            "name": "Like Post",
            "description": "Tap to like a post. The heart icon will change to indicate that the post is liked."
        },
        {
            "name": "Comment on Post",
            "description": "Tap to add a comment on a post. A comment box will appear for text input."
        },
        {
            "name": "Share Post",
            "description": "Tap to share the post with others through direct messages or other social media platforms."
        },
        {
            "name": "Save Post",
            "description": "Tap to save the post to your saved collection for later viewing."
        },
        {
            "name": "View Tagged People",
            "description": "View information about people tagged in a post."
        },
        {
            "name": "View All Comments",
            "description": "Tap to view all comments on a post, especially if there are more than a few comments."
        },
        {
            "name": "More Actions for Post",
            "description": "Tap to view additional options for the post such as reporting, copying link, etc."
        }
    ],
    "52e92cce957416c52f0c11fa5490fd56": [
        {
            "name": "View Avatar",
            "description": "View the profile picture or avatar of the user from their story or feed."
        },
        {
            "name": "View Profile",
            "description": "Tap on a user’s name or avatar to view their profile."
        },
        {
            "name": "View Story",
            "description": "Tap to view a user’s story in full-screen mode."
        },
        {
            "name": "Follow User",
            "description": "Follow a user by tapping their profile button from the story or post feed."
        },
        {
            "name": "Unfollow User",
            "description": "Unfollow a user by tapping the follow button again if you are already following them."
        },
        {
            "name": "Navigate Between Posts",
            "description": "Swipe or tap to move to the next or previous post or story in the feed."
        },
        {
            "name": "Refresh Feed",
            "description": "Pull down to refresh the feed or check for new updates."
        },
        {
            "name": "Zoom Image",
            "description": "Pinch to zoom in or out of an image or photo in the feed."
        },
        {
            "name": "View Media Group",
            "description": "View a collection of photos or videos grouped under a media group, such as a photo album."
        },
        {
            "name": "Switch Between Tabs",
            "description": "Switch between different sections of the app (e.g., Stories, Feed, Explore) by tapping the appropriate tab."
        },
        {
            "name": "Toggle Notification Settings",
            "description": "Adjust notification settings for the account or story through the profile or settings menu."
        },
        {
            "name": "View Story Reactions",
            "description": "View who has reacted to your story or posts."
        },
        {
            "name": "Explore New Content",
            "description": "Tap on the explore tab to discover new content, including posts, stories, and accounts."
        },
        {
            "name": "View Activity Log",
            "description": "View your activity log, including recent posts, likes, comments, and interactions."
        }
    ],
    "1c7b7442065a11629883a16896df72e2": [
        {
            "name": "Like",
            "description": "Tap the heart icon to like a post."
        },
        {
            "name": "Comment",
            "description": "Tap the comment icon to open the comment section of a post."
        },
        {
            "name": "Share",
            "description": "Tap the share icon to send the post to others."
        },
        {
            "name": "Save",
            "description": "Tap the save icon to add the post to your saved collection."
        },
        {
            "name": "More Options",
            "description": "Tap the more options button to access additional actions such as reporting, copying the link, or turning on notifications for the post."
        },
        {
            "name": "Follow",
            "description": "Tap the username button to follow the user who posted the content."
        },
        {
            "name": "Avatar View",
            "description": "Tap on the profile avatar to view the user's profile."
        },
        {
            "name": "Open Menu",
            "description": "Tap the menu button (hamburger icon or bottom navigation) to open app-wide navigation options."
        },
        {
            "name": "Search",
            "description": "Tap the search tab to explore content, accounts, or tags."
        },
        {
            "name": "Activity",
            "description": "Tap the activity tab to view your recent interactions, such as likes, comments, and follows."
        },
        {
            "name": "Reels",
            "description": "Tap the Reels tab to view and interact with short video content."
        },
        {
            "name": "Profile",
            "description": "Tap the profile tab to view your own Instagram profile."
        },
        {
            "name": "Camera",
            "description": "Tap the camera tab to open the camera for posting photos or videos."
        },
        {
            "name": "Zoom",
            "description": "Pinch or spread your fingers on an image or video to zoom in or out."
        },
        {
            "name": "Swipe Navigation",
            "description": "Swipe left or right to navigate between posts, stories, or other sections of the app."
        },
        {
            "name": "Story Interaction",
            "description": "Tap a story's avatar to view or interact with the user's stories."
        },
        {
            "name": "Avatar Image",
            "description": "Tap on the profile picture to view a larger version of the avatar or open the user's profile."
        },
        {
            "name": "Like More Info",
            "description": "Tap on the 'Liked by' text to view the list of users who liked the post."
        },
        {
            "name": "View Carousel",
            "description": "Swipe left or right on carousel images or videos within a post."
        },
        {
            "name": "Swipe Refresh",
            "description": "Swipe down on the feed to refresh the content and load new posts."
        },
        {
            "name": "Post Action",
            "description": "Tap the more options button (three dots) on a post to perform actions like sharing, saving, or reporting."
        },
        {
            "name": "Tap to View Post",
            "description": "Tap on a post to open and view it in full screen, including its media and interactions."
        },
        {
            "name": "User Tagging",
            "description": "Tap on tags within a post to view the tagged user's profile."
        },
        {
            "name": "View Comments",
            "description": "Tap the comment section to expand and view all comments on a post."
        },
        {
            "name": "Navigation Bar Interaction",
            "description": "Use the bottom navigation bar to quickly switch between tabs (Home, Search, Camera, Reels, Profile)."
        },
        {
            "name": "View Notifications",
            "description": "Tap the notification icon to view recent interactions and notifications from other users."
        },
        {
            "name": "Story Seen State",
            "description": "View the 'seen' status of stories (e.g., a check mark indicating that you've already viewed the story)."
        },
        {
            "name": "Share Post",
            "description": "Tap the share icon to send a post to specific users or through other apps."
        },
        {
            "name": "User Info",
            "description": "Tap on a user's profile name to view their profile details and recent posts."
        },
        {
            "name": "Open Post Details",
            "description": "Tap on the post to open the post details, including likes, comments, and sharing options."
        }
    ],
    "219680e7e6aef349ff508ae3508177d7": [
        {
            "name": "View Reel",
            "description": "Watch the reel by adven_of_a_small_island_boy. Double tap on the reel video container to play or pause."
        },
        {
            "name": "Follow",
            "description": "Follow the user Noel Nick Grey using the 'Follow' button provided on the screen."
        },
        {
            "name": "Like",
            "description": "Like the reel by tapping on the 'Like' button."
        },
        {
            "name": "View Likes",
            "description": "View the total number of likes by selecting the 'View likes' button, which displays the current count."
        },
        {
            "name": "Comment",
            "description": "Open the comment section for the reel by clicking on the 'Comment' button."
        },
        {
            "name": "View Comments",
            "description": "View all comments for the reel by selecting the 'View comments' button, which displays the current count."
        },
        {
            "name": "Share",
            "description": "Share the reel by using the 'Share' button available on the screen."
        },
        {
            "name": "Reshare",
            "description": "View the number of times the reel has been reshared with the 'Reshare number' button."
        },
        {
            "name": "Open More Options",
            "description": "Access additional options for the reel by using the 'More' button component."
        },
        {
            "name": "Play Audio",
            "description": "Play the associated audio of the reel by selecting the 'Audio' button."
        },
        {
            "name": "Create Reel",
            "description": "Initiate the creation of a new reel by using the 'Create a reel' button."
        },
        {
            "name": "Home",
            "description": "Navigate back to the home feed of the app using the 'Home' tab in the navigation menu."
        },
        {
            "name": "Search and Explore",
            "description": "Explore new content and search within the app using the 'Search and explore' tab."
        },
        {
            "name": "Open Camera",
            "description": "Access the camera feature to create new content by selecting the 'Camera' tab."
        },
        {
            "name": "View Profile",
            "description": "Navigate to the user's profile page by selecting the 'Profile' tab in the navigation menu."
        }
    ],
    "df1ab4defbaaab708176b696141ae895": [
        {
            "name": "Search and Explore",
            "description": "Explore trending content and perform more detailed searches by selecting the search and explore tab."
        }
    ],
    "3cfa860cab4107ace85a8194a08407ec": [
        {
            "name": "Cancel",
            "description": "Cancel the current operation and go back to the previous screen."
        },
        {
            "name": "Photo",
            "description": "Select the Photo option to capture or select an image to post."
        },
        {
            "name": "Video",
            "description": "Select the Video option to capture or select a video to post."
        },
        {
            "name": "New Post",
            "description": "Start creating a new post by selecting media from the gallery or capturing new media."
        },
        {
            "name": "Recents",
            "description": "Access the most recent media files available in the gallery."
        },
        {
            "name": "Next",
            "description": "Proceed to the next step in the media selection or post creation process."
        },
        {
            "name": "Select Multiple",
            "description": "Enable the option to select multiple media items for a post or gallery action."
        },
        {
            "name": "Camera",
            "description": "Switch to the camera mode to capture new photos or videos."
        },
        {
            "name": "Shutter",
            "description": "Capture a photo or video using the shutter button."
        },
        {
            "name": "Gallery",
            "description": "Open the gallery to view and select previously taken photos or videos."
        },
        {
            "name": "Post",
            "description": "Publish the selected media as a post on the feed."
        },
        {
            "name": "Story",
            "description": "Share the selected media as a story visible for 24 hours."
        },
        {
            "name": "Reel",
            "description": "Create and publish a short-form video as a reel."
        },
        {
            "name": "Live",
            "description": "Go live and broadcast video in real-time to your followers."
        },
        {
            "name": "Search",
            "description": "Open the search bar to explore content or find users."
        },
        {
            "name": "Home",
            "description": "Navigate back to the home feed displaying posts from followed accounts."
        },
        {
            "name": "Search and explore",
            "description": "Discover new content and profiles through the search and explore tab."
        },
        {
            "name": "Profiles",
            "description": "Access and manage your user profile and posts."
        }
    ],
    "963b604a07910978be21d1ebdb09110a": [
        {
            "name": "AR Effect Picker",
            "description": "Interface to select augmented reality effects that can be applied to the camera view for creative media captures."
        },
        {
            "name": "Camera Shutter Button",
            "description": "A button on the interface for capturing photos or videos using the in-app camera."
        },
        {
            "name": "Flash Toggle",
            "description": "A control allowing the user to turn the camera's flash on or off."
        },
        {
            "name": "Switch Camera",
            "description": "A button to toggle between front and back camera views."
        },
        {
            "name": "Gallery Button",
            "description": "Button to open the device's gallery to view and select media files."
        },
        {
            "name": "Boomerang",
            "description": "Use the boomerang effect."
        },
        {
            "name": "Layout",
            "description": "Use the layout feature."
        }
    ],
    "35891652e3541b71247ff3195ea0e9eb": [
        {
            "name": "Navigate Home",
            "description": "Return to the home screen from the current view."
        },
        {
            "name": "Camera Preview",
            "description": "Access the camera preview overlay to capture images or videos."
        },
        {
            "name": "Flash Toggle",
            "description": "Switch the camera flash on or off."
        },
        {
            "name": "Story Settings",
            "description": "Open settings related to creating a story."
        },
        {
            "name": "Select Multiple Photos",
            "description": "Enable the option to select multiple photos from the gallery."
        },
        {
            "name": "Post",
            "description": "Initiate the process to post a new feed on the platform."
        },
        {
            "name": "Create Story",
            "description": "Begin creating a new story with the available tools."
        },
        {
            "name": "Create Reel",
            "description": "Start creating a new reel with video content."
        },
        {
            "name": "Go Live",
            "description": "Start a live video broadcast to your audience."
        },
        {
            "name": "Search",
            "description": "Enter and search for content or profiles within the platform."
        },
        {
            "name": "Gallery Access",
            "description": "Access photo and video gallery for selection and management."
        },
        {
            "name": "Photo Selection",
            "description": "Select photos from the gallery for uploading or editing."
        },
        {
            "name": "Explore Reels",
            "description": "Navigate and explore the reels section to view video content."
        },
        {
            "name": "View Profile",
            "description": "Access the user's profile to view or edit settings."
        },
        {
            "name": "Gesture Control",
            "description": "Utilize gesture-based navigation and controls within the app."
        },
        {
            "name": "Change Reel Length",
            "description": "Adjust the time length of the reel being created."
        },
        {
            "name": "Select Speed",
            "description": "Choose the playback speed for captured video content."
        },
        {
            "name": "Timer Function",
            "description": "Set a countdown timer for capturing photos or videos."
        },
        {
            "name": "Add Audio",
            "description": "Include background music or audio to video content."
        },
        {
            "name": "Enable Effects",
            "description": "Add visual effects to the photos or videos being captured."
        },
        {
            "name": "Access Drafts",
            "description": "View and manage saved draft content ready for future posting."
        },
        {
            "name": "Use Templates",
            "description": "Select and apply pre-made templates for content creation."
        },
        {
            "name": "Search and Explore",
            "description": "Discover new content or profiles by searching and exploring."
        },
        {
            "name": "Navigate Tabs",
            "description": "Switch between different sections of the app using the tab bar."
        },
        {
            "name": "Access Camera Tools",
            "description": "Use different camera tools and settings for enhanced photography or videography."
        }
    ],
    "8e66288bf12723f543255baadf81b933": [
        {
            "name": "Start Live Broadcast",
            "description": "Start Live Broadcast."
        },
        {
            "name": "Live Broadcast Title",
            "description": "Edit live title."
        },
        {
            "name": "Audience",
            "description": "Manage live audience."
        },
        {
            "name": "Schedule Live",
            "description": "Schedule a live broadcast."
        },
        {
            "name": "Camera Switch",
            "description": "Switch between front and back cameras to change your perspective in capturing media."
        },
        {
            "name": "AR Effect Picker",
            "description": "Select augmented reality effects to enhance your media with virtual elements and interactive features."
        },
        {
            "name": "Post Options",
            "description": "Choose whether to post the captured media as a Feed post, Story, Reel, or Live broadcast."
        },
        {
            "name": "Effects Slider",
            "description": "Adjust various effects on your media post-capture, enhancing its aesthetics or providing unique styles."
        }
    ],
    "3b9229ca9d1dc3b37648f6498e2a53e9": [
        {
            "name": "Add to story",
            "description": "Select photos from gallery to add to story."
        },
        {
            "name": "Camera",
            "description": "Take a photo or video and add it to your story."
        },
        {
            "name": "Draft",
            "description": "Select content from your draft to add to your story."
        }
    ],
    "state12": [
        {
            "name": "Log In",
            "description": "Sign in to your account by clicking the 'Log in' button."
        },
        {
            "name": "Log Into Another Account",
            "description": "Sign in using a different Instagram account by clicking the 'Log into another account' button."
        },
        {
            "name": "Create New Account",
            "description": "Register a new Instagram account by clicking the 'Create new account' button."
        }
    ],
    "state14": [
        {
            "name": "Edit Cover",
            "description": "Click on the 'Edit cover' option to make adjustments to the cover photo."
        },
        {
            "name": "Write Caption",
            "description": "Click on the caption input area to write a caption and add hashtags."
        },
        {
            "name": "Add Hashtags",
            "description": "Use the hashtags suggestion option to add relevant hashtags to your post."
        },
        {
            "name": "Create Poll",
            "description": "Use the poll suggestion option to create and add a poll to your post."
        },
        {
            "name": "Tag People",
            "description": "Select the 'Tag people' option to tag users in your post."
        },
        {
            "name": "Add Location",
            "description": "Click on the 'Add location' option to include a location with the post."
        },
        {
            "name": "Choose Audience",
            "description": "Select 'Audience' to decide who can see the post, e.g., everyone."
        },
        {
            "name": "Set Profile Display",
            "description": "Choose profile display settings to determine where this post will appear, such as the Main grid and Reels grid."
        },
        {
            "name": "Rename Audio",
            "description": "Select 'Rename audio' to change the name of the audio associated with the post."
        },
        {
            "name": "Save Draft",
            "description": "Click on the 'Save draft' button to save your current progress on the post as a draft for later editing or sharing."
        },
        {
            "name": "Share Post",
            "description": "Press the 'Share' button to publish the post to your profile immediately."
        }
    ],
    "state17": [
        {
            "name": "Edit Highlight Cover",
            "description": "Tap the 'Edit cover' link to change the cover image for a highlight."
        },
        {
            "name": "Edit Highlight Title",
            "description": "Tap the 'highlight_title' button to modify the title of a highlight."
        },
        {
            "name": "Select Media",
            "description": "Tap on media images to select or deselect them using the 'selected_item_overlay' and 'media_toggle' buttons."
        }
    ],
    "state18": [
        {
            "name": "Edit Highlight Cover",
            "description": "Click on the action bar title (id=18) to open the cover editing interface."
        }
    ],
    "state15": [
        {
            "name": "Browse stories",
            "description": "Navigate through different pictures of your story using the browse button."
        },
        {
            "name": "Create Story Highlight",
            "description": "Access the option to create a story highlight from a reel."
        },
        {
            "name": "Send Story",
            "description": "Send the current story to another user through a reshare button."
        },
        {
            "name": "More Options",
            "description": "Open additional settings and options related to the reel viewer with the more options button."
        }
    ],
    "sttae16": [
        {
            "name": "Remove from highlight",
            "description": "Remove the picture from highlight. "
        },
        {
            "name": "Edit highlight",
            "description": "Edit the highlight picture."
        },
        {
            "name": "Share the picture of Story",
            "description": "Send the current story to another user through a reshare button."
        },
        {
            "name": "Copy link",
            "description": "Copy the link of the story."
        },
        {
            "name": "Show QR code",
            "description": "Show the QR code of the story."
        }
    ],
    "state11": [
        {
            "name": "Log Out Prompt",
            "description": "The user is presented with a prompt asking if they are sure they want to log out of their account."
        },
        {
            "name": "Log Out Confirmation",
            "description": "The user can confirm their decision to log out by clicking the 'Log out' button."
        },
        {
            "name": "Cancel Log Out",
            "description": "The user can cancel the log-out operation by clicking the 'Cancel' button."
        },
        {
            "name": "Open Dialog",
            "description": "The dialog containing the log-out confirmation and cancel options is displayed on the screen."
        },
        {
            "name": "Scroll Through Content",
            "description": "The user can scroll through the content in the scrollable area (identified by the 'scroll_view' div)."
        },
        {
            "name": "Interact with Sticky Footer",
            "description": "The user can interact with elements in the sticky footer at the bottom of the screen, which might contain navigation options or other actionable buttons."
        },
        {
            "name": "Close Dialog",
            "description": "The user can close the dialog without taking any action, usually by pressing the 'Cancel' button or tapping outside the dialog."
        },
        {
            "name": "Confirm Action",
            "description": "The user can click the primary action button (Log out) to confirm their action."
        }
    ]
}