{
    "com.google.android.apps.chrome.Main": [
        {
            "name": "Forward",
            "description": "Navigate forward to the next page in the browser history."
        },
        {
            "name": "Bookmark",
            "description": "Add the current webpage to your bookmarks for easy access later."
        },
        {
            "name": "Download",
            "description": "Initiate a download of the content currently being viewed."
        },
        {
            "name": "Page Info",
            "description": "View detailed information about the current webpage."
        },
        {
            "name": "New Tab",
            "description": "Open a new browsing tab to start a fresh session."
        },
        {
            "name": "Open History",
            "description": "View the browsing history to find previously visited pages."
        },
        {
            "name": "Delete Browsing Data",
            "description": "Remove saved browsing data such as history, cache, and cookies."
        },
        {
            "name": "Downloads",
            "description": "Access and manage all downloaded files within the browser."
        },
        {
            "name": "Bookmarks",
            "description": "View and manage all saved bookmarks for easy access to favorite sites."
        },
        {
            "name": "Recent Tabs",
            "description": "Access a list of tabs recently closed or synced from other devices."
        },
        {
            "name": "Share",
            "description": "Share the current webpage with others through various communication channels."
        },
        {
            "name": "Find in Page",
            "description": "Search for specific text within the current webpage."
        },
        {
            "name": "Translate",
            "description": "Translate the current webpage to another language."
        },
        {
            "name": "Listen to This Page",
            "description": "Use text-to-speech to listen to the content of the current page."
        },
        {
            "name": "Add to Home Screen",
            "description": "Create a shortcut to the current webpage on your device's home screen."
        },
        {
            "name": "Get Image Descriptions",
            "description": "Retrieve and view descriptions for images on the current page, useful for accessibility."
        },
        {
            "name": "Search or Enter URL/link",
            "description": "Use the URL bar to enter a search query or type a URL/link to navigate to a specific website."
        },
        {
            "name": "Start voice search",
            "description": "Initiate a voice-based search using the microphone button."
        },
        {
            "name": "Search with camera",
            "description": "Use Google Lens to search using the camera for images or objects."
        },
        {
            "name": "Share Discover content",
            "description": "Share specific articles from the Discover section using the share button."
        },
        {
            "name": "Switch or close tabs",
            "description": "Use the tab switcher button to manage open tabs or close them."
        },
        {
            "name": "Signed-in account settings",
            "description": "Open settings related to the signed-in Google account."
        },
        {
            "name": "Open Home Page",
            "description": "Navigates to the home page of the browser, typically a predefined page set as the home by the user or the browser."
        },
        {
            "name": "Customize and Control Chrome",
            "description": "Opens the menu to allow the user to customize and control various aspects of Google Chrome, like settings, extensions, history, etc."
        },
        {
            "name": "Subscription",
            "description": "View and manage the subscriptions list to see content from subscribed channels."
        },
        {
            "name": "Profile",
            "description": "Access the user's profile section for account settings and personalizations."
        },
        {
            "name": "Forget Password",
            "description": "Initiate the process to recover your password if you've forgotten it"
        },
        {
            "name": "Create New Account",
            "description": "Start the process to create a new Facebook account"
        },
        {
            "name": "Secure Connection Status",
            "description": "View the security status icon indicating the connection is secure"
        },
        {
            "name": "View Edit History",
            "description": "Access the edit history of the current Wikipedia page to see past revisions."
        },
        {
            "name": "Open Language Options",
            "description": "Use the language button to select different languages for viewing Wikipedia."
        },
        {
            "name": "Edit Bookmark",
            "description": "Edit or manage your bookmarks for quick access to preferred articles or sections."
        },
        {
            "name": "Privacy Policy",
            "description": "Provides access to the privacy policy details for the user to review."
        },
        {
            "name": "Submit Price Request",
            "description": "Allows the user to submit a request to obtain the price of the domain within 24 hours."
        },
        {
            "name": "Privacy Settings",
            "description": "Enables the user to adjust privacy settings according to their preferences."
        },
        {
            "name": "View Filter Options",
            "description": "Click on the filter options to refine search results based on specific criteria."
        },
        {
            "name": "Select Filter",
            "description": "Click on any filter category like 'Video', 'Shopping', 'News', etc., to refine results."
        },
        {
            "name": "View Detailed Information",
            "description": "Click the button to view more information about a specific search result."
        },
        {
            "name": "View External Link",
            "description": "Click on an external link to open the referenced webpage, e.g., GitHub or CSDN blog."
        },
        {
            "name": "Open Search Tools",
            "description": "Click the search tools button to access advanced search options."
        },
        {
            "name": "Update Location",
            "description": "Click the update location button to refresh or update your current location."
        },
        {
            "name": "Show Experimental Features",
            "description": "Click on experimental feature options or tools to explore additional functionalities."
        },
        {
            "name": "Enable Notifications",
            "description": "Click the button to allow notifications for updates related to your search."
        },
        {
            "name": "View News Item",
            "description": "View a specific news item, such as 'Evidence of ‘Negative Time’ Found in Quantum Physics Experiment' or 'Google’s New Gmail App Password Rules—You Have 24 Hours To Comply'."
        },
        {
            "name": "Refresh",
            "description": "Reload the current webpage to refresh its content."
        },
        {
            "name": "History",
            "description": "Access the browsing history to view previously visited web pages."
        },
        {
            "name": "Delete browsing data",
            "description": "Clear the browsing data, including history, cache, and cookies."
        },
        {
            "name": "Recent tabs",
            "description": "Access recently closed tabs and reopen them if needed."
        },
        {
            "name": "Open Preferences",
            "description": "Opens a menu to adjust settings and preferences for the application or page."
        },
        {
            "name": "Download link",
            "description": "Initiates the download of the content from the link, saving it to the user's device."
        },
        {
            "name": "Remove",
            "description": "Allows the user to remove or delete the selected item from the current view or list."
        }
    ],
    "com.google.android.apps.lens.MainActivity": [
        {
            "name": "Open Lens View",
            "description": "Access the Lens view container to use the Google Lens functionalities."
        },
        {
            "name": "View Promo Banner",
            "description": "Check any promotional banners available in the promo banner container."
        },
        {
            "name": "Interact with Lens Content",
            "description": "Engage with the content available in the Lens content area, possibly images or text to analyze."
        },
        {
            "name": "Manage Lens Settings",
            "description": "Adjust lens-related settings within the coordinator container."
        },
        {
            "name": "Display Lens Error Message",
            "description": "View any error messages when Lens encounters issues, shown in the error message container."
        },
        {
            "name": "Access Action Menu",
            "description": "Open the action menu which might contain additional options or settings."
        },
        {
            "name": "Use Magnifier",
            "description": "Activate the magnifier container for a closer view of elements on-screen."
        },
        {
            "name": "Use Camera",
            "description": "Capture images or videos through the camera fragment container for processing with Google Lens."
        },
        {
            "name": "Open Lens Gallery",
            "description": "View and select images from the Lens gallery to analyze or search."
        },
        {
            "name": "Toggle Filter Options",
            "description": "Switch between various filter settings for specific Lens modes."
        },
        {
            "name": "Select Image from Gallery",
            "description": "Choose an image from the gallery using the picker button for Lens analysis."
        },
        {
            "name": "Use Shutter Button",
            "description": "Capture a new image using the shutter button view for immediate analysis."
        },
        {
            "name": "Navigate Overlay Buttons",
            "description": "Utilize overlay buttons for actions such as closing, going back, or accessing more options."
        },
        {
            "name": "Search with Camera",
            "description": "Enable the feature to search for objects using the phone's camera directly within the app."
        },
        {
            "name": "Translate Text",
            "description": "Use Lens to translate text from an image in the Translate mode of filters."
        },
        {
            "name": "Review Search History",
            "description": "Access past searches performed with Lens in the history button container."
        },
        {
            "name": "Adjust Flash",
            "description": "Toggle the flash settings for better visibility in low light conditions when using the camera."
        },
        {
            "name": "Engage with Google Lens Features",
            "description": "Further interact with the features, like recognizing objects or extracting text, provided by Google Lens."
        },
        {
            "name": "Manage Overlays",
            "description": "Handle multiple overlays that might present additional information or settings on top of the visual interface."
        },
        {
            "name": "Explore Other Options",
            "description": "Utilize the overflow menu to explore more options or settings within the app."
        }
    ],
    "com.google.android.libraries.speech.transcription.ui.TranscriptionActivity": [
        {
            "name": "Search",
            "description": "Initiate a search query via a text input or voice command."
        },
        {
            "name": "Microphone",
            "description": "Activate or deactivate the microphone for voice search or transcription."
        },
        {
            "name": "Stop Listening",
            "description": "Stop the ongoing voice transcription or listening activity."
        }
    ],
    "org.chromium.chrome.browser.app.bookmarks.BookmarkActivity": [
        {
            "name": "Sort and View Options",
            "description": "Tap on the 'Sort and view options' button to modify how bookmarks are displayed, possibly sorting them by name, date, etc."
        },
        {
            "name": "Create New Folder",
            "description": "Tap on the 'Create new folder' button to create a new folder for organizing bookmarks."
        },
        {
            "name": "Close Dialog",
            "description": "Tap on the 'Close dialog' button to close any open dialog window or menu."
        },
        {
            "name": "Search Bookmarks",
            "description": "Use the 'Search your bookmarks' button to find specific bookmarks by entering keywords or phrases."
        },
        {
            "name": "Access Mobile Bookmarks",
            "description": "Tap on the 'Mobile bookmarks' button to view the list of bookmarks saved under this category."
        },
        {
            "name": "Access Other Bookmarks",
            "description": "Tap on the 'Other bookmarks' button to view the list of bookmarks saved under this category."
        },
        {
            "name": "Access Reading List",
            "description": "Tap on the 'Reading list' button to view your list of saved pages, noting how many are unread."
        }
    ],
    "org.chromium.chrome.browser.settings.SettingsActivity": [
        {
            "name": "Access Settings",
            "description": "Interact with settings options, including Privacy and security, Notifications, Theme, Advanced, and more."
        },
        {
            "name": "Help & Feedback",
            "description": "Press the Help & Feedback button to get assistance or provide feedback about the application."
        },
        {
            "name": "View Payment Methods",
            "description": "Access and manage your saved payment methods."
        },
        {
            "name": "Manage Addresses",
            "description": "View and edit your saved addresses."
        },
        {
            "name": "Privacy and Security",
            "description": "Adjust privacy and security settings."
        },
        {
            "name": "Perform Safety Check",
            "description": "Run a safety check to ensure the security of the application and data."
        },
        {
            "name": "Configure Notifications",
            "description": "Manage notification settings."
        },
        {
            "name": "Change Theme",
            "description": "Select and change the application's theme."
        },
        {
            "name": "Advanced Settings",
            "description": "Access advanced settings for further configuration."
        },
        {
            "name": "Manage Tabs",
            "description": "Organize and manage open tabs."
        },
        {
            "name": "Set Homepage",
            "description": "Define or change the homepage setting."
        },
        {
            "name": "Accessibility Settings",
            "description": "Adjust accessibility settings for easier use."
        },
        {
            "name": "Site Settings",
            "description": "Modify settings related to specific sites, such as permissions and data."
        },
        {
            "name": "Change Language Preferences",
            "description": "Set or change language preferences for the browser."
        },
        {
            "name": "Manage Downloads",
            "description": "View or manage your browser download history."
        },
        {
            "name": "View About Chrome",
            "description": "View the version of Chrome you are using, along with other browser details."
        },
        {
            "name": "Delete Browsing Data",
            "description": "Delete browsing history, cookies, site data, and cache."
        },
        {
            "name": "Access Privacy Guide",
            "description": "Review key privacy and security controls."
        },
        {
            "name": "Manage Third-Party Cookies",
            "description": "Adjust settings related to third-party cookies."
        },
        {
            "name": "Send Do Not Track Request",
            "description": "Toggle the 'Do Not Track' request option."
        },
        {
            "name": "Toggle Safe Browsing",
            "description": "Enable or disable the Safe Browsing feature for enhanced protection."
        },
        {
            "name": "Toggle Secure Connections",
            "description": "Control the setting that prioritizes the use of secure connections (HTTPS)."
        },
        {
            "name": "Toggle Secure DNS",
            "description": "Adjust the setting for using a secure DNS for enhanced security."
        },
        {
            "name": "Lock Incognito Tabs",
            "description": "Enable or disable the option to lock incognito tabs when leaving Chrome."
        },
        {
            "name": "Change Search Engine",
            "description": "View and, if applicable, change the default search engine."
        },
        {
            "name": "Access Password Manager",
            "description": "Manage your saved passwords through Google Password Manager."
        },
        {
            "name": "View Account Info",
            "description": "View information related to your Google account."
        },
        {
            "name": "Manage Sync",
            "description": "View and modify synchronization settings."
        }
    ]
}