{
    "com.vega.audio.library.AddAudioActivity": "This activity allows users to search, download, import, and manage music, connect to TikTok, extract audio from videos, and handle offline scenarios.",
    "com.vega.audio.musicimport.extract.ExtractGalleryMusicActivity": "The activity allows users to select media files, extract audio tracks from videos, and view details like media duration.",
    "com.vega.edit.activity.CutSameEditActivity": "Allows users to resize and crop items within a template to ensure they fit appropriately within the designated frame.",
    "com.vega.edit.editpage.activity.EditActivity": "The activity includes exporting, editing, managing audio, adding media, controlling playback, reversing vedio, adjusting visuals, applying transition, applying effects, adjusting speed and enhancing projects.",
    "com.vega.gallery.activity.MediaSelectActivity": "This activity allows users to switch media categories, select specific items, view thumbnails, and proceed after selections.",
    "com.vega.libcutsame.activity.CutSameReplaceMediaActivity": "Replace the existing video in a template with a new one to update or customize the content.",
    "com.vega.libcutsame.activity.LiteEditorActivity": "This activity focuses on editing, exporting, adjusting, and managing the audio and video elements of multimedia templates.",
    "com.vega.main.MainActivity": "Manage projects(add vedio or photos to project) and media by renaming, duplicating, or deleting them. Access creation tools and interfaces for editing, capturing, and enhancing images. Use features for project setup and user interaction.",
    "com.vega.multicutsame.view.MultiCutSamePreviewActivity": "The activity allows users to select and edit templates, manage music tracks, export projects, and access author information while facilitating media playback.",
    "com.vega.recorder.LvRecordActivity": "The activity allows users to use the camera to shoot video,.You can use special effects and filters when shooting."
}